# parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov4s backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, Bottleneck, [64]],
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4
   [-1, 2, BottleneckCSP, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 5-P3/8
   [-1, 8, BottleneckCSP, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 7-P4/16
   [-1, 8, BottleneckCSP, [512]],
   [-1, 1, Conv, [1024, 3, 2]], # 9-P5/32
   [-1, 4, BottleneckCSP, [1024]],      # 10
   [-1, 1, SPPCSP, [512]],              # 11
   [-1, 3, TR_SPPCSP_CSP2, [512, False]],   # 12
  ]

# yolov4s head
# na = len(anchors[0])
head:
  [[-1, 1, Conv, [256, 1, 1]],                # 13
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [8, 1, Conv, [256, 1, 1]],                 # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   [-1, 2, SPPCSP_CSP, [256]],            # 17
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [6, 1, Conv, [128, 1, 1]],                 # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   [-1, 2, SPPCSP_CSP, [128]],            # 22
   [-1, 1, Conv, [256, 3, 1]],
   [-2, 1, Conv, [256, 3, 2]],
   [[-1, 17], 1, Concat, [1]],                # cat
   [-1, 2, SPPCSP_CSP, [256]],            # 26
   [-1, 1, Conv, [512, 3, 1]],
   [-2, 1, Conv, [512, 3, 2]],
   [[-1, 12], 1, Concat, [1]],                # cat
   [-1, 2, SPPCSP_CSP, [512]],            # 30
   [-1, 1, Conv, [1024, 3, 1]],

   [[23,27,31], 1, Detect, [nc, anchors]],    # Detect(P3, P4, P5)
  ]